{
  "name": "Feng Lin",
  "children": [
    {
      "name": "Programming",
      "children": [
        {
          "name": "Python (8 years)",
          "description": "I am proficient in using Python and have a strong understanding of its core concepts. I have been using Python since my undergraduate studies and have applied it across various domains. My experience includes web development (using Flask and Django), desktop software tool development (with Tkinter and PyQt), data analysis (with pandas, NumPy, Matplotlib, and Seaborn), AI-related tasks (like data collection using requests, BeautifulSoup, and Selenium), and use Python to handle many testing and development tasks in job."
        },
        {
          "name": "Java (3 years)",
          "description": "I have a foundational understanding of Java and can use it for various coding tasks. I have worked with Java frameworks in both research and professional settings, including developing Java test frameworks for API testing (JUnit) and web testing (Selenium)."
        },
        {
          "name": "Shell (3 years)",
          "description": "I have a fundamental understanding of shell scripting and command invocation and can use it for development tasks. I have experience writing automation scripts for Linux server maintenance and developing functional features using shell scripts for server-based products."
        },
        {
          "name": "C/C++ (2 years)",
          "description": "I have a basic understanding of C/C++ and achieved a perfect score in my university C course. I have also used C/C++ for product development in my job career."
        },
        {
          "name": "SQL (2 years)",
          "description": "I have a basic understanding of SQL and development experience with MySQL, SQLite, and MongoDB. I also have foundational knowledge of query optimization and database security."
        },
        {
          "name": "JavaScript/HTML/CSS/Node.js (1 year)",
          "description": "I am familiar with the fundamental keywords of these web languages and have developed multiple web-based frontends, including CI/CD dashboards and testing platforms."
        },
        {
          "name": "PHP (0.5 years)",
          "description": "I have a basic understanding of PHP and have used it for security testing."
        }
      ]
    },
    {
      "name": "DevOps",
      "children": [
        {
          "name": "CI/CD",
          "children": [
            {
              "name": "Git/SVN (8 years)",
              "description": "I have a basic understanding of Version Control Systems (VCS) and have used Git and SVN for multiple versions and projects. My experience includes managing teams' code, resolving merge conflicts, configuring Git settings, and handling version control workflows."
            },
            {
              "name": "GitHub Actions (4 years)",
              "description": "I have used GitHub Actions for both personal and professional projects for multiple years. I am experienced in building CI/CD pipelines from empty, writing workflow configurations, managing environments, and utilizing self-hosted runners for automation and deployment."
            },
            {
              "name": "Docker/VMware/PyEnv (4 years)",
              "description": "I have experience using virtual environments such as Docker, VMware, and Pyenv for development and deployment management. My experiences include writing Dockerfiles, installing and configuring Windows, Linux, and macOS systems, performing periodic backups (such as VMware snapshots), managing code libraries requirements(with pip/Poetry/Conda), and so on."
            },
            {
              "name": "Jenkins (2 years)",
              "description": ""
            },
            {
              "name": "GitLab (1 year)",
              "description": ""
            }
          ]
        },
        {
          "name": "Networking",
          "children": [
            {
              "name": "Virtual Cloud Platforms"
            },
            {
              "name": "network topologies"
            },
            {
              "name": "troubleshooting"
            }
          ]
        }
      ]
    },
    {
      "name": "Testing",
      "children": [
        {
          "name": "Design",
          "children": [
            {
              "name": "software quality models"
            },
            {
              "name": "case design techniques"
            }
          ]
        },
        {
          "name": "Functional",
          "children": [
            {
              "name": "API-Testing"
            },
            {
              "name": "Mobile"
            }
          ]
        },
        {
          "name": "Automation",
          "children": [
            {
              "name": "Selenium"
            },
            {
              "name": "Playwright"
            }
          ]
        },
        {
          "name": "API Testing",
          "children": [
            {
              "name": "Postman"
            },
            {
              "name": "REST Assured"
            }
          ]
        }
      ]
    },
    {
      "name": "AI",
      "children": [
        {
          "name": "Machine Learning",
          "children": [
            {
              "name": "MLOps"
            },
            {
              "name": "LLM Deployment"
            }
          ]
        },
        {
          "name": "AI-Assisted Testing"
        }
      ]
    },
    {
      "name": "Business Domain",
      "children": [
        {
          "name": "IoT",
          "children": [
            {
              "name": "MLOps"
            },
            {
              "name": "LLM Deployment"
            }
          ]
        },
        {
          "name": "AI-Assisted Testing"
        }
      ]
    },
    {
      "name": "Others",
      "children": [
        {
          "name": "English",
          "children": [
            {
              "name": "TOEFL 97"
            },
            {
              "name": "IELTS 7.5"
            }
          ]
        },
        {
          "name": "Chinese",
          "children": [
            {
              "name": "Native"
            }
          ]
        }
      ]
    }
  ]
}
