{
  "name": "Feng Lin",
  "children": [
    {
      "name": "Develop",
      "children": [
        {
          "name": "Python (8 years)",
          "description": "I am proficient in using Python and have a strong understanding of its core concepts. I have been using Python since my undergraduate studies and have applied it across various domains. My experience includes web development (using Flask and Django), desktop software tool development (with Tkinter and PyQt), data analysis (with pandas, NumPy, Matplotlib, and Seaborn), AI-related tasks (like data collection using requests, BeautifulSoup, and Selenium), and use Python to handle many testing and development tasks in job."
        },
        {
          "name": "Java (3 years)",
          "description": "I have a foundational understanding of Java and can use it for various coding tasks. I have worked with Java frameworks in both research and professional settings, including developing Java test frameworks for API testing (JUnit) and web testing (Selenium)."
        },
        {
          "name": "Shell (3 years)",
          "description": "I have a fundamental understanding of shell scripting and command invocation and can use it for development tasks. I have experience writing automation scripts for Linux server maintenance and developing functional features using shell scripts for server-based products."
        },
        {
          "name": "C/C++ (2 years)",
          "description": "I have a basic understanding of C/C++ and achieved a perfect score in my university C course. I have also used C/C++ for product development in my job career."
        },
        {
          "name": "SQL (2 years)",
          "description": "I have a basic understanding of SQL and development experience with MySQL, SQLite, and MongoDB. I also have foundational knowledge of query optimization and database security."
        },
        {
          "name": "JS/HTML/CSS (1 year)",
          "description": "I am familiar with the fundamental keywords of these web languages and have developed multiple web-based frontends, including CI/CD dashboards and testing platforms."
        },
        {
          "name": "PHP (0.5 years)",
          "description": "I have a basic understanding of PHP and have used it for security testing."
        }
      ]
    },
    {
      "name": "DevOps",
      "children": [
        {
          "name": "Git/SVN (8 years)",
          "description": "I have a basic understanding of Version Control Systems (VCS) and have used Git and SVN for multiple versions and projects. My experience includes managing teams' code, resolving merge conflicts, configuring Git settings, and handling version control workflows."
        },
        {
          "name": "GitHub Actions (4 years)",
          "description": "I have used GitHub Actions for both personal and professional projects for multiple years. I am experienced in building CI/CD pipelines from empty, writing workflow configurations, managing environments, and utilizing self-hosted runners for automation and deployment."
        },
        {
          "name": "Docker & Cloud (4 years)",
          "description": "I have experience using virtual environments such as Docker, VMware, Virtual Cloud Platforms, and Pyenv for development and deployment management. My experiences include writing Dockerfiles, installing and configuring Windows, Linux, and macOS systems, performing periodic backups (such as VMware snapshots), managing code libraries requirements(with pip/Poetry/Conda), and so on."
        },
        {
          "name": "Network (4 years)",
          "description": "I have a basic understanding of TCP/IP, DNS, and ARP protocols, along with hands-on experience in designing and deploying computer network topologies for development and testing environments. My experience includes configuring Ethernet network settings, setting up routers, switches, network firewalls, and access control systems."
        },
        {
          "name": "Jira/Confluence (2 years)",
          "description": "I have experience using Jira and Confluence for project management and documentation. My expertise includes task management, workflow configuration (Waterfall/Agile), and document organization."
        },
        {
          "name": "Jenkins (2 years)",
          "description": "I have experience using Jenkins to build CI/CD pipelines for multiple projects and versions. This includes configuring webhooks to monitor Git push events, automating test execution, and deploying applications to different environments."
        },
        {
          "name": "GitLab (1 year)",
          "description": "I have experience deploying the GitLab framework on a local server and configuring it for CI/CD workflows."
        }
      ]
    },
    {
      "name": "Testing & QA",
      "children": [
        {
          "name": "Test Design (5 years)",
          "description": "I am proficient in analyzing requirements and designing test plans. I have experience writing test cases using test design techniques such as boundary value analysis and equivalence partitioning. Additionally, I follow software quality models to design various types of test cases, including compatibility, usability, performance, and security testing."
        },
        {
          "name": "Automation (5 years)",
          "description": "I have multiple years of experience transforming functional test cases into automated tests. My expertise includes designing and developing test automation frameworks, writing test scripts, managing automated test cases, executing daily test runs, and generating reports."
        },
        {
          "name": "Performance (3 years)",
          "description": "I have a basic understanding of software performance models and experience in designing performance test scenarios. I also have hands-on experience executing performance test cases, including stability, load, stress, and endurance testing."
        },
        {
          "name": "Functional (2 years)",
          "description": "I have experience using testing tools for executing test cases, reproducing bugs, and generating test reports."
        },
        {
          "name": "Security (2 years)",
          "description": "I gained extensive knowledge of software security during my bachelor's degree and have hands-on experience in security testing for security products."
        },
        {
          "name": "",
          "description": ""
        },
        {
          "name": "QA (2 years)",
          "children": [
            {
              "name": "Test Team Leader",
              "description": "I have led two teams: an 11-member SDET team focused on developing and delivering testing solutions to testing teams, and a 16-member cloud platform testing team."
            },
            {
              "name": "Quality Models",
              "description": "I have a basic understanding of full-lifecycle software quality assurance and experience with Shift-Left and Shift-Right testing. My expertise includes designing and implementing software quality standards."
            }
          ]
        },
        {
          "name": "",
          "children": [
            {
              "name": "Cloud API (4 years)"
            },
            {
              "name": "Web (4 years)"
            },
            {
              "name": "MobileApp (2 years)"
            },
            {
              "name": "AI-based (2 years)"
            },
            {
              "name": "Custom OS (1.5 years)"
            },
            {
              "name": "PC Software (1 year)"
            },
            {
              "name": "Hardware (1 year)"
            }
          ]
        },
        {
          "name": "Tools&Frameworks",
          "children": [
            {
              "name": "unittest/pytest"
            },
            {
              "name": "Selenium"
            },
            {
              "name": "Postman"
            },
            {
              "name": "Jmeter"
            },
            {
              "name": "Wireshark"
            },
            {
              "name": "Appium"
            },
            {
              "name": "Kali Linux"
            },
            {
              "name": "Robot Framework Series",
              "description": "For automation testing frameworks, I apply keyword-driven, data-driven, and other automation testing methodologies.\n\n"
            },
            {
              "name": "Machine Arm",
              "description": "for hardware automation, simulate human arm movements like open door lockers"
            }
          ]
        }
      ]
    },
    {
      "name": "Industries",
      "children": [
        {
          "name": "Food Delivery (0.5 years)",
          "description" : "While working at Alibaba, I gained experience in the food delivery ecosystem, including restaurant listing in map applications, promotion calculations, food ordering, and delivery status tracking."
        },
        {
          "name": "OS (0.5 years)",
          "description": "While working at Huawei and Sangfor, I gained experience in testing custom operating systems, including custom mobile OS and server OS."
        },
        {
          "name": "IoT (3 years)",
          "description": "I worked at TCL in the Internet of Things (IoT) department for three years, where I tested various smart home devices, including smart TVs, smart door locks, IoT mobile applications (Android/iOS), cloud APIs, and AI-based services such as voice control."
        },
        {
          "name": "Security (2 years)",
          "description": "While working at Sangfor, I gained experience with security products, including network firewalls, access control, endpoint detection and protection, and virus detection engines."
        }
      ]
    },
    {
      "name": "AI",
      "children": [
        {
          "name": "ML (2 years)",
          "description": "I have tested ML-based algorithms and services for various products. My experience including data collection and labeling, conducting daily precision and recall evaluations across different scenarios and benchmarking performance against competing products with similar functionalities."
        },
        {
          "name": "LLM (2 years)",
          "description": "I have experience deploying local LLMs for research and have worked with various models such as OpenAI, Claude, and DeepSeek for different scenarios, analyzing and comparing their performance."
        }
      ]
    },
    {
      "name": "Languages",
      "children": [
        {
          "name": "English",
          "description": "I achieved a TOEFL score of 97 and an IELTS score of 7.5."
        },
        {
          "name": "Chinese",
          "description": "Mandarin is my native language."
        }
      ]
    }
  ]
}
